app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Hola"], ["user_id", 1], ["post_id", 1], ["created_at", "2017-12-19 00:36:31.373124"], ["updated_at", "2017-12-19 00:36:31.373124"]]
---
	def create
		@comment = Comment.new(comment_params)
		@comment.user = current_user
		@comment.post = @post
		@comment.save