app/controllers/dashboard_controller.rb

UPDATE "users" SET "role" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role", 0], ["updated_at", "2018-04-21 03:29:28.855402"], ["id", 81]]
---
  def update
    respond_to do |format|
      if @user.update(dashboard_params)