app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hola"], ["content", "Post mio\r\n"], ["user_id", 56], ["created_at", "2017-12-18 23:30:23.693946"], ["updated_at", "2017-12-18 23:30:23.693946"]]

  def destroy
    #authorize! :destroy, @post
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 11]]